-- phpMyAdmin SQL Dump
-- version 4.9.3
-- https://www.phpmyadmin.net/
--
-- Hôte : localhost:8889
-- Généré le :  mer. 12 fév. 2020 à 18:47
-- Version du serveur :  5.7.26
-- Version de PHP :  7.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- Base de données :  `lomaa_2019`
--
CREATE DATABASE IF NOT EXISTS `lomaa_2019` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;
USE `lomaa_2019`;

-- --------------------------------------------------------

--
-- Structure de la table `articles`
--

CREATE TABLE `articles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `titre` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `contenu` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` datetime NOT NULL,
  `auteur` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `fichier` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `categorie_id` bigint(20) UNSIGNED NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `articles`
--

INSERT INTO `articles` (`id`, `titre`, `contenu`, `date`, `auteur`, `image`, `fichier`, `slug`, `user_id`, `categorie_id`, `valide`, `publish`, `created_at`, `updated_at`) VALUES
(3, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p dir=\"rtl\">وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض</p>', '2019-11-22 00:00:00', 'وريم ايبسوم', 'yJpdiI6IlwvMW4yMkZCRlJVWFRxK1JZamljYVF3PT0iLCJ2YWx.jpg', NULL, 'eyJpdiI6IlFzOHNaQkV3', 1, 4, 0, 0, '2019-11-22 18:56:32', '2019-11-22 18:56:32'),
(4, 'انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار رقائق', '<p dir=\"rtl\">لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار رقائق &quot;ليتراسيت&quot; (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل &quot;ألدوس بايج مايكر&quot; (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم إيبسوم.</p>\r\n\r\n<p dir=\"rtl\">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام &quot;هنا يوجد محتوى نصي، هنا يوجد محتوى نصي&quot; فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، وإذا قمت بإدخال &quot;lorem ipsum&quot; في أي محرك بحث ستظهر العديد من المواقع الحديثة العهد في نتائج البحث. على مدى السنين ظهرت نسخ جديدة ومختلفة من نص لوريم إيبسوم، أحياناً عن طريق الصدفة، وأحياناً عن عمد كإدخال بعض العبارات الفكاهية إليها.</p>\r\n\r\n<p dir=\"rtl\">هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '2019-11-22 00:00:00', 'وريم ايبسوم', 'yJpdiI6ImFlSTF6d0FNTTROUVFQOG5henFNOFE9PSIsInZhbHV.jpg', NULL, 'eyJpdiI6IjJQWXY0d0xudGNOZ', 1, 10, 0, 0, '2019-11-22 19:00:42', '2019-11-22 22:10:29'),
(5, 'يوضع في التصاميم لتعرض', '<p>test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;test&nbsp;</p>', '2019-11-23 00:00:00', 'وريم ايبسوم', 'yJpdiI6InJodnc0ZXQwQ3J1VnNlZnp6dHBMZVE9PSIsInZhbHV.jpg', NULL, 'kZsSVJvc1dlZDd6ZnRsd', 1, 10, 0, 0, '2019-11-22 23:11:06', '2019-11-22 23:11:06'),
(7, 'test articleq', '<p>qsdqsdqsdqsdqsdqsd</p>', '2019-11-23 00:00:00', 'qdqsdqsd', 'yJpdiI6Ikk0Wm8yNzBiQjB1UWhNSHNFQWRBeWc9PSIsInZhbHV.jpg', NULL, 'lU4STVkVkpkNHFUMTBGM', 1, 17, 1, 0, '2019-11-23 13:29:43', '2020-01-21 13:57:21'),
(8, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p>&nbsp;art icle par user</p>', '2019-11-24 00:00:00', 'user', 'yJpdiI6IlwveHpLbjByYW5weHdvSitkRGZZUlwvUT09IiwidmF.jpg', NULL, 'ml2bmp5Sk5WUjBESUJPQ', 2, 17, 0, 0, '2019-11-23 22:44:33', '2019-11-23 22:44:33'),
(9, 'test', '<p>qsdqsd</p>', '2019-11-24 00:00:00', 'qsdqsdsd', 'yJpdiI6IjdvZFwvbFdOMldEUGcyQSt6YjRKRHF3PT0iLCJ2YWx.jpg', NULL, 'nFQSzU2N0tjWXFodjFlb', 2, 4, 0, 0, '2019-11-23 23:19:14', '2020-02-05 12:26:25'),
(10, 'test', '<p>qsdqsd</p>', '2019-11-24 00:00:00', 'qsdqsd', 'yJpdiI6IktiTVNuaFFOcW1GYTFJaStKRG1BcFE9PSIsInZhbHV.jpg', NULL, 'lwvblpRMVJQZFR6S1lpa', 1, 4, 1, 0, '2019-11-24 00:22:52', '2020-02-05 12:26:19'),
(11, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p>sqsssssssssssssssssssssssssss</p>', '2019-11-24 00:00:00', 'وريم ايبسوم', 'yJpdiI6ImFka0ZydjVUOGJBdVI3M01kb3puNHc9PSIsInZhbHV.jpg', NULL, 'llhVjhaYm0xeno5VXA0N', 2, 4, 0, 0, '2019-11-24 00:25:17', '2020-02-05 12:26:08'),
(18, 'نموذج لوريم ايبسوم عربي', '<p dir=\"rtl\" style=\"text-align:justify\">أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم.&quot;</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&quot;سيت يتبيرسبايكياتيس يوندي أومنيس أستي ناتيس أيررور سيت فوليبتاتيم أكيسأنتييوم</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">دولاريمكيو لايودانتيوم,توتام ريم أبيرأم,أيكيو أبسا كيواي أب أللو أنفينتوري فيرأتاتيس ايت</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كياسي أرشيتيكتو بيتاي فيتاي ديكاتا سيونت أكسبليكابو. نيمو أنيم أبسام فوليوباتاتيم كيواي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">فوليوبتاس سايت أسبيرناتشر أيوت أودايت أيوت فيوجايت, سيد كيواي كونسيكيونتشر ماجناي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">دولارس أيوس كيواي راتاشن فوليوبتاتيم سيكيواي نيسكايونت. نيكيو بوررو كيوايسكيوم</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كيواي نون نيومكيوام ايايوس موداي تيمبورا انكايديونت يوت لابوري أيت دولار ماجنام</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">ألايكيوام كيوايرات فوليوبتاتيم. يوت اينايم أد مينيما فينيام, كيواس نوستريوم أكسيركايتاشيم</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">يلامكوربوريس سيوسكايبيت لابورايوسام, نايساي يوت ألايكيوايد أكس أيا كوموداي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كونسيكيواتشر؟ كيوايس أيوتيم فيل أيوم أيوري ريبريهينديرايت كيواي ان إيا فوليوبتاتي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">فيلايت ايسسي كيوم نايهايل موليستايا كونسيكيواتيو,فيلايليوم كيواي دولوريم أيوم فيوجايات كيو</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">فوليوبتاس نيولا باراياتيور؟&quot;</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&quot; أت فيرو ايوس ايت أكيوساميوس ايت أيوستو أودايو دايجنايسسايموس ديوكايميوس كيواي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">بلاندايتاييس برايسينتايوم فوليوبتاتيوم ديلينايتاي أتكيوي كورريوبتاي كيوأوس دولوريس أيت</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">سيما يليكيوسيونت ان كيولبا كيواي أوفايكيا ديسيريونت موللايتايا انايماي, أيدي ايست لابوريوم</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">دايستا ينستايو. نام لايبيرو تيمبور, كيوم سوليوتا نوبايس ايست ايلاجينداي أوبتايو كيومكيوي</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">نايهايل ايمبيدايت كيو ماينيوس ايدي كيوود ماكسهيمي بلاسايت فاسيري بوسسايميوس,أومنايس</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">فوليوبتاس ايت ايوت أسسيو ميندايست, أومنيوس دولار ريبيللينديوس. تيمبورايبيوس أيوتيم</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كيواس موليستاياس أكسكيبتيوراي ساينت أوككايكاتاي كيبايدايتات نون بروفايدنت</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أيت دولوريوم فيوجا.ايت هاريوم كيوايديم ريريوم فاكايلايسايست ايت أكسبيدايتا</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كيوايبيوسدام ايت أوت</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أوففايكايس ديبايتايس أيوت ريريوم نيسيسسايتاتايبيوس سايبي ايفينايت يوت ايت فوليبتاتيس&nbsp;</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">ريبيودايايانداي ساينت ايت موليسفاياي نون ريكيوسانداي.اتاكيوي ايريوم ريريوم هايس تينيتور</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أ ساباينتي ديليكتيوس, يوت أيوت رياسايندايس فوليوبتاتايبص مايوريس ألايس</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">كونسيكيواتور أيوت بيرفيريندايس دولورايبيوس أسبيرايوريس ريبيللات .&quot;</p>', '2020-01-21 00:00:00', 'test', 'yJpdiI6IkE5TDhDZ2ZsbEVhcVdGd24wWGc3akE9PSIsInZhbHV.jpg', NULL, 'eyJpdiI6ImlmMU9WbWdsU2p2T', 1, 5, 1, 0, '2020-01-21 15:55:56', '2020-02-05 12:05:44'),
(19, 'مقارنة الأديان عند المسلمين', '<p dir=\"rtl\" style=\"text-align:justify\">الحمد لله، والصلاة والسلام على نبيه ومصطفاه... وبعدُ: فقد يكون المرء غير مُجَانِب للصواب إذا قال: إن معرفة الأديان والمذاهب أمر يهمُّ الناس جميعًا، سواء مَنْ يعتقدون بدين، ومن لا يعتقدون. وحاجة الإنسانية إلى دراسة الأديان ترتبط بحاجة كل إنسان -خاصة المثقف- إلى الاطمئنان إلى سلامة تفكيره، وسلوكه، أو اعتقاده، وتصرفاته[1]. ويذكر العلماء أن علم الأديان يبحث عن منشإ الأديان وتطورها، وفي الأسس التي ترتكز عليها الأديان المختلفة، وفي أوجه الاتفاق، أو الاختلاف فيما بينها. وبعبارة أخرى: إنه يناقش تاريخ الأديان، ويوضح فلسفتها، ويوازن بينها. وتاريخ الأديان يبحث عن نشأة المعتقدات الدينية وتطوراتها، ومرتكزاتها، لدى الشعوب البُدائية المتخلفة، والشعوب المتمدنة. فالغرض -إذن- من دراسة الأديان هو معرفتها. وأما فلسفة الأديان فإنها تبحث في العلاقات بين الأسس التي تستند إليها الأديان المختلفة، وفي الغايات التي تهدف إليها. وبدخل ضمن مباحثها علم ما وراء الطبيعة، وعلم الكلام، أو اللاهوت، وعلم التصوف[2]. بينما مقارنة الأديان أو تاريخ الأديان المقارن يدرس خصائص ومميزات كل دين، ويوازن بينها وبين خصائص ومميزات الأديان الأخرى[3]. ولقد قدَّم القرآن الكريم الدَّرْس المنهجي الموضوعي الأول في مجال مقارنة الأديان، كما حفل بالحديث المُفَصَّل، المستوعب عن الأديان، والعقائد، والملل، والنحل، والمذاهب المختلفة المتنوعة، وعرض مقالاتهم بدقة، واستقصاء، ثم ناقشها وبيّن وجوه الزَّلَل، والخَطَل، والبطلان، والزيف فيها. وقارن بينها وبين الدين الصحيح الذي &nbsp;أرسل الله به رسله عليهم السلام[4]. ونجد ذلك واضحًا في حديث القرآن الكريم عن اليهود والنصارى، حيث فصّل القرآن مقالاتهم، واعتقاداتهم، ومذاهبهم. ولم يعالجها متعجلاً في نصّ أو نصين؛ وإنما جاء فيها بفيض غزير زاخر، يتناولها من أقطارها، ويكشف عن خباياها وأبعادها. وعلى سبيل المثال: فإن الحديث عن بنى إسرائيل، جاء في القرآن من أكثر المسائل نصوصًا، بعد العقائد[5]. ولقد اهتمَّ القرآن الكريم من البداية بأهل الكتاب[6] باعتبارهم الفريق الأولى بالدعوة والاستجابة قبل غيره؛ لأن الأصول الرئيسة -قبل التحريف- مشتركة بين أهل الكتاب ودعوة الإسلام. كما أن الله تعالى شاء أن يعامل الرسول صلى الله عليه وسلم في حياته طوائف اليهود والنصارى في غالب مراحل دعوته؛ لذلك خاطبهم الله تعالى قائلًا: {قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إلى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ ۚ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ} [آل عمران:64]. وناقش القرآن أهل الكتاب في عقائدهم المبتدعة، وما حرّفوه من كتبهم، وأمرهم بالإيمان بنبوة محمد صلى الله عليه وسلم التي بشَّر بها أنبياؤهم، وحَوَتْهَا كتبهم، وحذرهم أن يكونوا أول كافر به، فالرسول صلى الله عليه وسلم مصدق لما معهم، والقرآن مهيمن على كتبهم بعد أن نسخها، واشتمل على أحسن ما فيها، وصدَّق عليه، كما في قوله تعالى: {يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِمَّا كُنْتُمْ تُخْفُونَ مِنَ الْكِتَابِ وَيَعْفُو عَنْ كَثِيرٍ ۚ قَدْ جَاءَكُمْ مِنَ اللَّهِ نُورٌ وَكِتَابٌ مُبِينٌ . يَهْدِى بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِهِ وَيَهْدِيهِمْ إلى صِرَاطٍ مُسْتَقِيمٍ} [المائدة:15-16]. كما سَاقَ القرآن الكريم مقالة الملاحدة الدهريين[7]. قال تعالى: {وَقَالُوا مَا هي إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ ۚ وَمَا لَهُمْ بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ} [الجاثية:24]. ومفهوم عقيدة الدهريين هو إنكار الحكيم الخالق القادر، ورفض ما بعد هذه الحياة من حقائق الدار الآخرة. والقرآن حين يعرض مقالة الدهريين يعرضها كما هي، ثم يعقب عليها بأنها قائمة على الظن، وليست وليدة العلم اليقيني، وكفي بالظنّ طريقًا لرفض هذه العقيدة؛ لأن العقائد الصحيحة إنما تقوم على العلم اليقيني[8]. وقد ذكر اليعقوبي [أحمد بن أبي يعقوب بن جعفر بن وهب بن واضح ت بعد 292هـ][9] في تاريخه المنسوب إليه؛ أن السبب في تسمية الدهرية بهذا الاسم أنها تزعم أن الإنسان لم يزل، ولن يزول، وأن الدهر دائم لا أوّل له ولا آخر[10]. كما تعرض الجاحظ [أبو عثمان عمرو بن بحر البصري الإمام اللغوي النحوي، تلميذ النظام البلخي ت 355هـ][11] للدهريين في كتابه (الحيوان) في أكثر من موضع، كاشفًا عن مقالتهم، وأسّ مذهبهم الذي هو الحسّ وحده؛ لأن الدهري لا يقرُّ إلا المحسوسات والعادات[12]. وبعبارة أخرى لا يقرُّ إلا بما أوجده العِيَان، وما يجرى مجرى العِيَان[13]. وعرض البيروني [أبو الريحان محمد بن أحمد ت 440هـ] لمذهب الدهرية في سياق مناقشته لمذاهب اليهود والنصارى والفرس وعلماء النجوم، حول تحديد التاريخ الذي وقع فيه طوفان نوح، فأشار إلى أبي معشر المنجم [جعفر بن محمد البلخي ت 272هـ][14]، وموافقته للمنجمين بما يخالف التاريخ الديني، ثم قال: &quot;...فلما تقررت لديه هذه الجملة على الطريق الذي مهّده، وكان قد خرج له المدة التي يسميها المنجمون أدوار الكواكب ثلاثمائة وستين ألف، وأولها متقدم لوقت الطوفان بمائة وثمانين ألف سنة، حكم جهلاً على أن الطوفان كان في كل مائة وثمانين ألف سنة، وسيكون فيما بعد كذلك ...&quot;[15]. وذكرهم الشَهْرَسْتَانِي [الأفضل محمد بن عبد الكريم بن أحمد أبو الفتح الشافعي المُتكلِّم ت 548هـ][16] فقال: &quot;... ومنهم مَنْ يقول بالمحسوس، ولا يقول بالمعقول، وهم الطبيعية. ومنهم مَنْ يقول بالمحسوس والمعقول، ولا يقول بحدود وأحكام، وهم الفلاسفة الدهرية&quot;[17]. وفي القرآن الكريم آيات كثيرة للمقارنة، تحدث فيها عن كثير من الأديان: سماوية كانت أو وضعية، فكما تحدث عن اليهود واليهودية والمسيح والمسيحية، تحدث كذلك عن عبدة الأصنام والطاغوت والملائكة، وسماها القرآن أديانًا مع بطلانها[18]، قال تعالى: {لَكُمْ دِينُكُمْ وَلِىَ دِينِ} [الكافرون:6][19]. ومن الطبيعي أن هذا العلم لم يظهر قبل الإسلام؛ لأن الأديان قبل الإسلام لم يعترف بعضها ببعض، وكان كل دين يعدّ ما سواه من الأديان والأفكار هرطقة وضلالاً. وحسبك أن تتذكر موقف اليهودية من النصرانية وموقف النصرانية من اليهودية. فاليهودية لم تعترف بالنصرانية والمسيح، واعتبرت المسيح عليه السلام ثائرًا، والنصرانية اعتبرت نفسها وريثة اليهودية، ولم تَرَ مع وجودها وجودًا لليهودية، ومثل ذلك موقف الهندوسية من البوذية، والبوذية من الهندوسية. بل وصل الأمر إلى أكثر من ذلك، فقد أنكرت كل طائفة دينية جميع الطوائف الأخرى المنتسبة لنفس الدين، وعدّت اتجاهاتها هَرْطَقة وضلالًا، وربما حكمت كل منها بالإعدام على أتباع سواها[20]. قال تعالى: {وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَى عَلَى شَىْءٍ وَقَالَتِ النَّصَارَى لَيْسَتِ الْيَهُودُ عَلَى شَىْءٍ وَهُمْ يَتْلُونَ الْكِتَابَ} [البقرة من الآية:113]. يقول العز بن عبد السلام [عبد العزيز بن عبد السلام السلمي ت 660هـ][21]: &quot;يعني اليهود بالمدينة ونصارى نجران قد وقع بينهم الاختلاف، وكتابهم واحد، فدلّ ذلك على ضلالهم، وحذَّر بذلك وقوع الاختلاف في القرآن؛ لأن اختلاف الفريقين أخرجهما إلى الكفر&quot;[22]. وهذا الاتجاه كان هو الاتجاه العام بين الأديان وبين المذاهب، ومن هنا لم يوجد علم مقارنة الأديان قبل الإسلام؛ لأن المقارنة نتيجة للتعدد، وليس التعدد معترفًا به عند أحد، فلم يوجد ما يترتب عليه، وهو المقارنة[23]. وإذا كان علم &quot;مقارنة الأديان&quot; يعني في العصر الحديث أن تُتَّخذ الأديان بعامة -كتابية ووضعية- والعقائد الدينية، أو الملل والنحل موضوعًا للدراسة العلمية بمناهج موضوعية لها أصولها وخصائصها وضوابطها التي اصطلح عليها أهل هذا الحقل، فإن الفكر الإسلامي منذ القرن الثاني للهجرة قد انفتح على أديان العالم، وجعلها موضوعًا مستقلًا للدراسة والبحث، ووضع العلماء لذلك مناهج علمية سديدة؛ فوصفوا أديان العالم وحللوها وقارنوها وأرَّخوا لها وانتقدوا بعضها، وكانوا يستمدون أوصافهم لكل ديانة من مصادرها الموثوق بها، ويستقونها من منابعها الأولى... وهكذا فإنهم بعد أن اختطوه علمًا مستقلًا، اتخذوا له منهجًا علميًّا سليمًا[24]. ويذكر د. محمد الشرقاوي أن اهتمام المسلمين بمقارنة الأديان كان بتأثير مباشر من القرآن الكريم، فعقدوا لهذا الغرض كتبًا مفردة أو فصولاً مُطوَّلة من مصنفاتهم[25]. وقد أدَّت الحرية والتعددية الدينية إلى وجود جوٍّ من التسامح الديني والفكري، وهذا أدَّى إلى المخالطة والتواصل والمعايشة التي نتج عنها الحوار والمناقشة، ثم ما لبث الأمر أن اتَّسع ليشمل جانب الدراسة لديانة الآخر فهمًا ووصفًا، وتحليلًا ومقارنة، مما أدَّى إلى نشوء فرع من العلم يُسمى علم مقارنة الأديان، يُعنى -أساسًا- بدراسة الملل والنحل. وهذا ما اعترف به المستشرق آدم متز[26]. كما يقرر فرانز روزنتال F.Rossental أن علم مقارنة الأديان أحد الإنجازات الرفيعة للحضارة الإسلامية أسهمت به في التقدم الفكري للإنسانية[27]: As one of the great contributions of Muslim civilization to mankind&#39;s intellectual progress &nbsp;وقد أشادت Encyc. Britannica بجهود المسلمين في حقل دراسة الأديان، وأبرزت نقطتين جديرتين بالإشارة إليهما: تتمثل النقطة الأولى في تحقيق السَّبْق في مِضْمار دراسة الأديان، والثانية هي احتفاظ المسلمين بقيم الوحي والعقل معًا أثناء دراسة الأديان، وهو الأمر الذي لا تتسم به الدراسات الغربية للأديان. ويَجْمُلُ بي أن أذكر عبارة دائرة المعارف البريطانية[28]: Meanwhile, Islamic theology had an impact on western Christianity, notably upon medieval Scholastic philosophy, in which the values of both reason and revelation were maintained. Muslim knowledge of other religions was in advance of European knowledge ولقد أشاد علماء الغرب بجهود القاضي عبد الجبار المعتزلي [ت 415هـ] في دراسته للنصرانية التي تضمنها كتاب (التثبيت). وتكمن أهمية جهود القاضي عبد الجبار -كما يراها الغربيون- في أن الدراسة احتوت على نصوص نادرة تلقى ضوءًا على أصل النصرانية، وعلى فرق النصرانية ذات الأصل اليهودي The Jewish &ndash; Christians&nbsp; كما أنها تشكل في الوقت نفسه أقدم رواية سريانية عن هذه العقائد. من هؤلاء: ؛David Sox الذي &nbsp;أخبر بأن دراسة القاضي أحدثت ثورة بين العلماء المتخصصين في كل أنحاء العالم، ويَحْسُنُ أن نذكر عبارته[29]: &quot;The new source created a stir among scholars around the world&quot; وإذا كان هناك فريق من الباحثين يقرر أن الدراسات الجادة في مجال علم الدين المقارن لم تظهر إلا مع كتابات ماكس ميلر الإنجليزي فإن لسان الحق يقول: إن المفكرين الإسلاميين قد قدموا إسهامات جادة لا يمكن إغفالها في مجال علم الدين بقسميه: تاريخ الأديان، ومقارنة الأديان[30]. والمُقرَّرُ في حقل الدِّراسات المُقارنة أنَّ الأبُوَّة الشرعية لعلم مقارنة الأديان ترجع إلى المسلمين. والخلاف يقع حول أوَّل مَنْ ألَّف من المفكرين المسلمين في هذا العلم، فعلى حين يذهب العلامة H. Pinard de La Boullaye -في كتابه (الدراسة المقارنة للأديان)- أنّ ابن حزم الأندلسي قد نال شرف السَّبْق، واعتبره رائدًا لمقارنة الأديان في الفكر الإنساني كله[31]. نجد آدم متز Adam Mez يُعتبر النوبختي -صاحب كتاب (الآراء والديانات) ت 202هـ أو 310هـ- أول مَنْ ألف في هذا العلم[32]. وقد وافقه د. أحمد شلبي على هذا الرأي[33]. أمَّا الأستاذ Sharpe فيرى أنَّ شرف كتابة أوَّل تاريخ للأديان في العالم يختص به الشهرستاني مؤلف كتاب (الملل والنحل). [34] يقول Sharpe: &quot;This outstanding work for outstrips anything which Christian writers were capable of Posducing at the same period ورأى رابع يرى أنَّ أبا عيسى الورَّاق الذي &nbsp;كتب (المقالات) له اليد الطُّولَى في حقل الدراسات المقارنة للأديان، وأنه أول مَنْ كتب في هذا المجال[35]. ومن المشاهير الذين كتبوا في مقارنة الأديان: الحسن بن موسى النوبختي الفقيه الشيعي المتفلسف صاحب كتابي (الآراء والديانات)، ولم يتمِّه، و(الرد على أصحاب التناسخ، أو التناسخيّة). [وقد ذكره محمد بن إسحاق النديم وابن النجار بلا وفاة][36]. والمسعودي بأبو الحسن علي بن الحسين الهذلي البغدادي ت 346هـ- صاحب كتاب (المقالات في أصول الديانات)، وهو كتاب خُصِّص للحديث عن الآراء والمذاهب الإسلامية وغير الإسلامية[37]، وكتاب (المعالي في الدرجات والإبانة في أصول الديانات)، وكذلك كتابه (التنبيه والإشراف)، وقد أورد فيه مبحثًا عن النصرانية[38]. ثم جاء المسبحي [عز الملك محمد بن أبي القاسم عُبَيْد الله بن أحمد بن إسماعيل بن عبد العزيز الرافضي ت 420هـ]. فكتب كتابه &quot;درك البغية في وصف الأديان والعبادات&quot;، وهو كتاب مُطوَّل يقع في حَوَالَىْ ثلاثة آلاف وخمسمائة ورقة [39]. وكتب أبو منصور [عبد القاهر ابن طاهر بن محمد البغدادي الأسفراييني ت 429 هـ] كتابيه (الملل والنحل)[40]، و(الفَرْق بين الفِرَق)، ويُصرِّح البغدادي في مطلعه بالباعث الذي دفعه إلى تأليفه، فيشير إلى أنه جاء استجابة لرغبة تلاميذه، ومريديه الذين طلبوا منه إعطاء شرح للحديث النبوي: &laquo;افترقت اليهود على إحدى وسبعين فرقة، وتفرَّقت النصارى على إحدى -أو: ثنتين- وسبعين فرقة، وتفترق أمتى على ثلاث وسبعين فرقة&raquo;[41]. وقد سألوه أن يقدم لهم في أثناء الشرح الفروق التي تُميِّز كل فرقة عن الأخرى، وأن يوضح لهم معالِم وسمات الفرقة الناجية، وما تمتاز به، وتتميز به -أيضًا- عن كل تلك الفرق الهالكة[42]. وقد تعامل البغدادي مع عقائد خصومه في كتابه (الفَرْق بين الفِرَق) بمنهج برهاني خطابي جدلي[43]. وجاء البيروني الفيلسوف الرياضي المُؤَرِّخ الذي تحدَّث عن اليهودية في كتابه (الآثار الباقية عن القرون الخالية)، وعن الهندوسية، وأديان الهند في كتابه: (في تحقيق ما للهند من مقولة مقبولة في العقل أو مرذولة) بدقة ونزاهة عميقتين [44]. وألَّف ابن حزم الأندلسي[45] (الفصل في الملل والأهواء والنحل) التي اتَّسم فيها بمنهجية عالية لعدة أسباب هي: أولًا: كان لا ينقد إلا النص الواضح الذي &nbsp;لا يحتمل التأويل، فكل ما له وجه من التأويل، ولو ضعيفًا أعرض عنه إلى غيره ليكون أبلغ في الرد على بعض ما ورد من كذب: &quot;ولو كان لهذا الخبر وجه وإن غمُض، ومخرج وإن بَعُد، أو أمكنت فيه حيلة، أو ساغ فيه تأويل ما ذكرناه&quot;[46]. ثانيًا: مراعاته للسياق في نقده للنصوص، وهو منهج معروف في فَهْم النصوص ونقدها، وقاعدة عقلية يقتضيها الفَهْم السليم والترتيب المنطقي، فلا يجوز أن نجتزئ النصوص ونفهمها فهمًا لا علاقة له بالسياق الذي &nbsp;وردت به. يقول د. عبد الرحمن بدوى: &quot;لا بد -أيضًا- أن نفهم الكلمات وِفْقًا للسياق، وهذا ما يُعْرف باسم قاعدة السياق، ومضمونها: أنه يجب ألا نفهم عبارة أو كلمة إلا وِفْقًا للسياق الذي&nbsp; وجد به...&quot;[47]. ومن تطبيقات هذه القاعدة في كلامه حين ردّ على ما نسب إلى يعقوب من أنه صارع الإله، ولم يستطع الإله أن يصرعه، فجادله بعضهم في ذلك، وقالوا إن يعقوب صارع مَلَكًا من الملائكة، فقال لهم: &quot;سياق الكلام يبطل ما تقولون ضرورة أنَّ فيه: كنتُ قويًّا على الله فكيف على الناس&quot;[48]. ثالثًا: لا يترك للمخالف أي شبهة يستمسك بها. فكان يرد على كل شبهة يرى أن المخالف يمكن أن يتكئ عليها، ومن تلك الشبهات تمسكهم بفهم سقيم لبعض الآيات القرآنية، والأحاديث النبوية، فكان يبطل شبهتهم، ويبين الفهم الصحيح للآيات والأحاديث النبوية. ومن ذلك قوله: &quot;فإن قال قائل جاهل: ففي القرآن أنه قال: {رَبِّ أَرِنِى كَيْفَ تُحْيِى الْمَوْتَىٰ} [البقرة من الآية:260]... نقول: ردًّا على من قال عن الأنبياء في التوراة أنهم لا يثقون بالله عز وجل حتى يطلبوا برهانًا، فإنما طلب -أي إبراهيم عليه الصلاة السلام- ذلك ليطمئن قلبه المنازع له إلى رؤية الكيفية في ذلك فقط&quot;[49]. وكتب الشهرستاني كتابه (الملل والنحل) واتَّسَم منهجه بالحياد في إيراد المقولات والاعتماد على التقابل، من خلال أفكار مرتبة ومنظمة&quot;[50]. ثم أمتعنا الجعفري -صالح بن الحسين بن طلحة [ت 688هـ][51]- بثالوثه الكتابي (الرد على النصارى -تخجيل من حرّف الإنجيل- البيان الواضح المشهود من فضائح النصارى) الذي &nbsp;يمثل دائرة من الأدب الدفاعي، جمع فيها الجعفري ما ورد في المؤلفات السابقة عليه[52].<br />\r\n<br />\r\nرابط المادة: http://iswy.co/e11mmt</p>', '2020-02-05 00:00:00', 'ياسر منير', 'yJpdiI6Ing0VHozMGEzTmlIWmMrcVV4WUl0ZXc9PSIsInZhbHV.jpg', NULL, 'nNudmZmN0EySDAwZFNiU', 1, 4, 1, 1, '2020-02-05 12:30:49', '2020-02-05 12:31:04'),
(20, 'أزمة تشريعية في ألمانيا على خلفية حظر النقاب', '<p dir=\"RTL\" style=\"text-align:justify\">يعتبر العلم وعملية الدراسة والتدريس من جملة المهن والصناعة المعاصرة، فلم يعد مجرد أمر تديني، يقوم به المرء استجابة لتعاليم دينه فحسب، ولم يعد كذلك أمرا هِوائيا لملء الفراغ والتسلية أو التزود فحسب. بل أصبح مَثَله مَثَل التجارة والبيع والشراء.. وقد تباينت تصانيف العلماء للعلم وأقسامه، كما كثر في هذا العصر أنواع التخصصات؛ الطبيعية منها والشرعية والتدريبية.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">وإذا ما أراد إنسان ما النظر في العلوم الشرعية المعاصرة التي توفرها الجامعات كتخصص؛ فإنه سيقف على عدد من التخصصات منها اللغة العربية وآدابها، القرآن والسنة وعلومهما، وعلم أصول الدين أو العقيدة أو علم الكلام (عقيدة، سيرة، الفكر الإسلامي، الفلسفة والمنطق).. والفقه وأصوله، وانبثق من هذا المعاملات المالية المعاصرة (Islamic Banking)، ويضاف إلى مجموع هذه التخصصات تخصص مقارنة الأديان؛ وهنا لفتة موجزة عن طبيعة التخصص فيه.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">من الجدير بالذكر أن هذا التخصص -كفن وعلم مستقل- أمر جديد في زمرة العلوم الشرعية. وعادة ما يقابل بالرفض والغرابة والاستهجان في الكثير من الجامعات الإسلامية، الشأن في ذلك كالشأن في علم الفلسفة والمنطق قديما. ومن هنا لا يكاد يُعترف به كتخصص في الجامعات الإسلامية؛ هذا من حيث النظرة الأكاديمية. أما من حيث موقف عامة المسلمين منه فهو المعرفة السطحية الطبيعية؛ فغالبا ما يكون أول ردة فعل -كمسلم- هو: لا مقارنة بين الأديان، كيف نقارن بين الإسلام وغيره وهو أفضل الأديان.. إن الدين عند الله الإسلام.. ومن يبتغ غير الإسلام دينا فلن يُقبل منه.. ولن ترضى عنك اليهود ولا النصارى حتى تتبع ملتهم&hellip; فما حقيقة هذا التخصص يا ترى؟</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>&nbsp;</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>النشأة والتسمية&nbsp;</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">عُرفت جذور هذا العلم قديما ولأول مرة في الفكر الإسلامي، بأسماء متنوعة وبمناهج عدة؛ لكنها فردية غالبا، وتهدف غالبا إلى إبراز مكانة الإسلام بين الأديان، فهو مرتبط بالتبرير والدفاع والدعوة إلى الله. فقد تناول القرآنُ الكريم فيما تناول دين الإسلام وأديان غير الإسلام بالحديث بين دفتيه؛ فتنبه المسلمون إلى دراسة الأديان جميعا؛ وعرف ما كان شأنه في دراسة مفردات &ldquo;الأديان والعقائد&rdquo; في العالم الإسلامي بمسميات عدة؛ فقد عُهد الوقوف عليه في كتب&nbsp;<strong>أصول الدين والعقائد</strong>، من باب الرد على المخالف، ومن صوره:&nbsp;<strong>الآراء والديانات</strong>،&nbsp;<strong>وصف الأديان</strong>. وعرف أيضا باسم&nbsp;<strong>الملل والنحل</strong>&nbsp;بيانا ووصفا، وهو يعرف الآن بمسميات &ndash;ستأتي- تكاد تتفق الرؤية الإسلامية مع غيرها في التسمية.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">أما في الفكر الغربي فقد ولد هذا الفن في منتصف القرن التاسع عشر على يد وفكر المتخصص في اللغات الألماني فريدريك ماكس مولر، حيث تنبه إلى ظاهرة الأديان وآثارها على نواحي الحياة المختلفة، وأن الدين هو الدافع الرئيسي لتحريك الناس، علاوة على أن الدين هو من أهم الأسباب والعوامل المؤثرة في اندلاع الحروب في تاريخ البشرية كما يرى، حيث إن الإنسان عدو ما جهل؛ فنادى إلى دراسة الأديان، والتعمق في كنهها وحقائقها &ndash;من باب أن الإنسان سيكون أكثر سعادة، إذا ما عرف كيف يفكر غيره، فتقلّ الحروب بين الناس بسبب الدين على الأقل ويعترف كلُّ بصاحبه من منظور التعددية، فتوجهت الجهود لتقنين ذلك، فخرج هذا العلم مقننا بأصول محكمة وجماعية بشكل أكاديمي لأول مرة في التاريخ، أو لأول مرة في التاريخ الغربي -على أقل تقدير كما يروق لبعض الباحثين-، ومن هنا سمي بالأب الروحي لعلم مقارنة الأديان. ومن ثم تباينت التسمية بناء على خلفية كل جامعة ودافع تدريسها كتخصص؛ فيسمى عند البعض بـ&rdquo;<strong>علم اللاهوت</strong>&nbsp;Divinity&rdquo; وعند طائفة &ldquo;ا<strong>لإلهيات</strong>&nbsp;Theology&rdquo;، وعند آخرين بـ&rdquo;<strong>دراسات الكتاب المقدس</strong>&nbsp;Biblical Studies&rdquo; أو &ldquo;<strong>دراسات الأديان</strong>&rdquo; أو &ldquo;<strong>تاريخ الأديان</strong>&rdquo; أو &ldquo;<strong>الإلهيات ودراسات الأديان</strong>&rdquo;&nbsp;<strong>أو &ldquo;الأديان والإلهيات</strong>&ldquo;.. ولكل تسمية قصة وسبب نزول لسنا بصدد ذكره هنا.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">ومن هنا، فعلم مقارنة الأديان ليس علم جدل ودفاع كل دين عن دينه، وإظهار جمال دينه ومميزاته عن الآخر.. بل هو لمجرد الدراسة والمعرفة البحتة كما يقولون.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>&nbsp;</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>طبيعة علم مقارنة الأديان</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>وعن حقيقة هذا التخصص فإن&nbsp;</strong>علم دراسات الأديان يعرف بأنه علم يهتم بدراسة دين أو دينين أو أكثر، أو دراسة عنصر من عناصر دين أو أكثر لغرض الوقوف على حقيقتها كما هو عند معتنقيها بمنهج موسوم واضح.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">ومن هنا ينطلق هذا العلم من&nbsp;<strong>تعريف الدين</strong>&nbsp;نفسه، والمقدمات المهمة في الحقل، ومن ثم التطرق إلى&nbsp;<strong>فلسفة الأديان</strong>&nbsp;والأهداف التي تلعبها الأديان في العالم والشعوب والسياسات والعلاقات. على أن&nbsp;<strong>مسألة تصنيف الأديان</strong>&nbsp;من المقدمات المهمة في الباب. كما أن من أهم عناصر هذا الحقل إبراز&nbsp;<strong>المناهج الموضوعية المختلفة في دراسة الأديان</strong>. وبالطبع فإن دراسة&nbsp;<strong>أديان العالم عقيدة ومؤسسا وكتبا وتاريخا</strong>&nbsp;من لب التخصص. ومن أهم قضايا هذا الحقل ربط الأحداث والمواقف وظواهر الحياة بالأديان، من مثل المرأة في الأديان، أو الحرب في الأديان، أو حقوق الإنسان، الحرية الدينية أو الاعتقادية، موقف الأديان من العلم وبناء الحضارات، وحوار الأديان.. وما إلى ذلك. ومن الجدير بالذكر أيضا أن عملية&nbsp;<strong>المقارنة ليس شرطا في هذا الحقل</strong>، وإن حمل اسم &ldquo;مقارنة الأديان&rdquo; أحيانا. فهو ممكن لكن ليس لازما؛ ولعل هذا أمر يختلط على كثير منا؛ فيستهجن!</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>&nbsp;</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>مناهج دراسة مقارنة الأديان</strong></p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\"><strong>ومن أهم القضايا الرئيسة في هذا التخصص مسألة مناهج دراسة الأديان؛</strong>&nbsp;فالدافع على الإقدام إلى دراسة الأديان في الإسلام هو الإسلام نفسه، ومن هنا فعنصر التقديس موجود دائم، ومتوفر؛ صاحب وثابت. ومع هذا فقد تنوعت مناهج علماء المسلمين في دراسة الأديان؛ فعندهم&nbsp;<strong>المنهج الجدلي</strong>&nbsp;أو النقدي ومنهج الرد، ومن العلماء السالكين لهذا المنهج الغزالي في&nbsp;<strong>الرد الجميل لألولهية عيسى بصريح الإنجيل</strong>، وابن تيمية في&nbsp;<strong>الجواب الصحيح لمن بدل دين المسيح.</strong>&nbsp;على أن هذا المنهج غير محبذ كثيرا في الفكر الغربي؛ لأنه ينافي فكرة الـتأسيس ويناقضها، إذ يهدم أكثر مما يبني كما يرون.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">وعندهم&nbsp;<strong>المنهج التحليلي المقارن</strong>&nbsp;ويُذكر أبو الحسن العامري هنا في كتابه&nbsp;<strong>الإعلام بمناقب الإسلام.</strong>&nbsp;وعندهم أيضا&nbsp;<strong>المنهج التحليلي النقدي،</strong>&nbsp;ويُمثل لذلك بابن حزم في&nbsp;<strong>كتابه الفصل في الملل والأهواء والنحل.</strong>&nbsp;كما عندهم<strong>&nbsp;المنهج الوصفي</strong>، والشهرستاني والبيروني من أكبر ممثلي هذا المنهج قديما؛ الأول في كتابه&nbsp;<strong>الملل والنحل</strong>، والثاني في كتابه&nbsp;<strong>تحقيق ما للهند من مقولة؛ مقبولة في العقل أو مرذولة</strong>. وقد يضاف إليهم الفاروقي وعرفان عبد الحميد فتاح حديثا، الفاروقي في كتابه&nbsp;<strong>الملل المعاصرة في الدين اليهودي</strong>، وChristian Ethics، وعرفان في&nbsp;<strong>النصرانية: نشأتها التاريخية وأصول عقائدها</strong>، إضافة إلى أعمال محمد عبد الله دراز وأحمد شلبي وأبو زهرة ومحمد الشرقاوي وآخرين.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">ومن جهة أخرى نجد أنه إن كان الدافع إلى دراسة الأديان عند المسلمين الدين نفسه، ففي الفكر الغربي الدافع ليس دينيا أبدا، فلا جَرَم أن لا اعتبار لعنصر القداسة؛ إلا وصفا. ولعل العامل في هذا معروف عندنا جميعا؛ فالغرب وضعوا أصول هذه الدراسة في حضارة لم تقم إلا بعد أن أُقصي الدين؛ وبعد أن أتعبهم الدين بقيادة رجال الكنيسة، وأثقلوهم بالتخلف والظلم والحرمان. (ومن هنا لا غرابة في الكتابة والقراءة عن مثل: موت الإله، ومستقبل الدين، ونهاية الدين، وتأليه الإنسان، أو استغناء العلم عن الدين). لذا تباينت مناهج دراسة الأديان في الغرب عنها في الفكر الإسلامي. فمن مناهج الغرب في دراسة الأديان &ldquo;<strong>المنهج الظاهراتي</strong>&ldquo;، وصف الدين كما هو ظاهر في الأعمال اليومية وطريقة العبادة والطقوس الدينية في الأفراح والأتراح. ومن الذين انتهجوا هذا المنهج عمانوئيل كانط في مواقفه الفلسفية ورؤيته إلى الدين، وإدموند هوسرل في&nbsp;<em>Handbook Of The History Of Religion</em>، وجيرالدوس فان دير ليو في&nbsp;<em>Religion In Essence And Manifestation</em>، وميرسيا إلياد في&nbsp;<em>The Sacred And</em>&nbsp;The Profane، ونينيان سمرت في&nbsp;<em>The Phenomenon Of Religion</em>. ومن المناهج الغربية في دراسة الأديان المنهج الفلسفي، ومن منتهجيها نينيان سمرت في كتابه world philosophies، وإيريك شارب في understanding Religion.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">ومن المناهج الغربية في دراسة الأديان المنهج الأنثربولوجي أو علم الاجتماع الديني، ويذكر من علمائها سير إدوارد بيرنت تايلور في كتابه Primitive Culture، وسير جيمس فريزر في كتابه The Golden Bough، و إيمانويل دوركايم في The Elementarsitey Forms Of The Religious Life، ومنهم كليفورد غريتز في كتابه The Interpretation Of Cultures.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">ومن مناهج علماء الغرب في دراسة الأديان المنهج الاجتماعي، وهو قرين الصلة بالمنهج الإنثربولوجي من حيث النظر إلى الدين كعامل أوجده المجتمع، إلا أن ضرورة تطور الدين من البدائية إلى التقدم ليس شرطا في المنهج الاجتماعي. لذا يذكر من علماء هذا المنهج من ذكر هناك، إضافة إلى نظرية كارل ماكس، وماكس ويبر في The Protestant Ethic And The Spirit Of Capitalism، وكتابه الآخر The Religion Of India. وآخر ما أذكر من مناهج علماء الغرب في دراسة الأديان&nbsp;<strong>المنهج النفسي</strong>، ومن رواد هذا المنهج سيجموند فرويد في كتابه Totem And Taboo، وكتابه الآخر The Future of An Illusion، ومن أوائل رواد هذا المنهج وليام جيمس في كتابه Varsiteieties Of Religious Experience.</p>\r\n\r\n<p dir=\"RTL\" style=\"text-align:justify\">هذه نبذة عن علم مقارنة الأديان -كتخصص دقيق له قسمه الخاص، لا كمادة تدرس في قسم العقيدة أو الفكر الإسلامي-، وما يدور حوله، والكلام يطول، وكل جزئية يصلح لمزيد شرح وتفصيل؛ غير أن الكاتب أراد إيصال تعريفه، وموضوعه، وثمرته، وفضله، وواضعه، وبعض مسائله ومناهجه.</p>', '2020-02-05 00:00:00', 'سيكو توري', 'yJpdiI6ImFVREtPYmxVSXlVTUlOVUh4OTB6OHc9PSIsInZhbHV.jpg', NULL, 'kJpaWExYnhIUFBQa1FTd', 1, 5, 1, 1, '2020-02-05 12:36:11', '2020-02-05 12:36:27'),
(21, 'وقفات مع كتاب التعريف والإرشاد بعقائد أهل السنة', '<p dir=\"rtl\" style=\"text-align:justify\">اتسمت معظم كتب العقيدة الإسلامية في التراث الإسلامي بعرضها قضايا أصول الدين من منظور الفرق الإسلامية الكبرى. وولّد ذلك إشكاليات كبيرة وخطيرة على الأمة لا زال أثرها إلى يومنا هذا، كما انبثقت من تلك المنهجية إشكاليات تفرق الأمة إلى واقعنا المعاصر، إذ من مستلزماتها عدم القدرة على تقديم قضايا أصول الدين من منظور ما يجمع المسلمين. صحيح أن تلكم المنهجية كانت سليمة ولا بدّ منها آنئذٍ؛ حيث كانت عبارة عن حوارات وأجوبة تلبي حديث الساعة، وتملأ الإشكالية الجديدة الطارئة والفراغ القائم. لكن الهدف من تعليم العقيدة الإسلامية في عصرنا هذا لا يقوم على التداعيات والإشكالات التي قامت عليها قديما، فوجب تغيير الأسلوب والمنهج والخطاب لتغيّر الدافع والهدف من التأليف وتغيير النمط المعيشي العام للناس، وما صاحب ذلك من مبادئ أخلاقية عالمية لا ترفض دينيا.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">الكتاب الذي بين يدينا عُنون بــ<strong>: التعريف والإرشاد بعقائد أهل السنة والجماعة</strong>. ألفه محمد يوسف إدريس (لم أجد له ترجمة، ولا كتاب آخر مؤلف)، وهو كتاب جديد، أول عهدي به هو معرض الكتب الدولية 2017 التي تقام سنويا في ماليزيا؛ نزلت الطبعة الأولى منها سنة 2016، من مطبوعات دار النور المبين بالأردن. تمحور الكتاب حول أربع إضاءات -كما أسماه المؤلف-، في ثلاثة أقسام، انصهر لبّ الكتاب وفكرته في الإضاءة الأولى (ص23 &ndash; 86)، والتي عنيت بتحديد مفهوم أهل السنة. وقامت الإضاءة الثانية على الإلهيات، وأسماه أيضا القسم الأول، وهو إضاءة أولى وقسم أول معاً.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">تضمنت الإضاءة الثانية أربعة أبواب&nbsp; (87 &ndash; 209). وأتت الإضافة الثالثة -وهو القسم الثاني- على مباحث النبوات (210 &ndash; 270)، ولم تقسم عناوينه لا إلى أبواب ولا إلى مباحث على خلاف القسم الأول. والأمر صحيح في الإضاءة الرابعة -والقسم الثالث- التي عنيت بدراسة السمعيات، لكن المؤلف استخدم هنالك تقسيما من نوع آخر؛ فناقش أربعا وعشرين قضية، أتى كل قضية من قضايا السمعيات تحت عنوان&nbsp;<strong>العقيدة السمعية الأولى، العقيدة السمعية الثانية..</strong>&nbsp;وهكذا (271 &ndash; 396)<strong>.&nbsp;</strong>وانتهى الكتاب في خاتمته بأبواب الكفر والجحود والإساءة إلى النبي عليه الصلاة والسلام.</p>\r\n\r\n<h4 dir=\"rtl\" style=\"text-align:justify\">الهدف من تأليف الكتاب</h4>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">مما لا ريب فيه أن المصنف لم يبذل جهده ووقته في تأليف الكتاب لعجزٍ قائم في المصنفات المبينة للعقيدة الإسلامية. ألف الكتاب لتثقيف عامة المسلمين بأن الأشاعرة هم أعيان أهل السنة والجماعة في التاريخ الإسلامي وإلى جانبهم الماتريدية، لا كما شاع عند شيخ الإسلام ابن تيمية (661/ 728) ومن تبنى آراءه من بعده وتأثر بها، فسعَوا إلى سحب البساط من تحت الأشاعرة وإلباس لقب أهل السنة والجماعة على آرائهم خاصة. ورأى أن ذلك ليس صحيحا تاريخيا وعلميا.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">بيّن في ص 14 أن عدد الأشاعرة يتجاوز المليار مسلم ومنتشرون في القارات الخمس، وهم أهل السنة، فلا بد من تثقيف المسلم بذلك وتبصيره بهذه الحقيقة. وذكر في هامش ص 36 أن أبا حنيفة هو أول متكلمي أهل السنة كما يصفه البغدادي. وبين أن هذه الحقيقة تخفى على الكثيرين من عامة المسلمين نتيجة الحملة القوية ضد علم الكلام على يد من تبنى رأي شيخ الإسلام ابن تيمية. فكل هذا يحتاج إلى بيان عكسي. وموقف المؤلف هذا يؤكد سبب تأليف الكتاب. ومما يؤكد سبب تأليف الكتاب أيضا قوله في ص58: &ldquo;للأشاعرة مظاهر من الفضل لا تخفى على الباحثين، وإن خفيت على عموم الناس الذين كتب هذا الكتاب لأجلهم&rdquo;. وقال في ص 84 &ldquo;تعريف جماهير المسلمين بعقيدة أهل السنة والجماعة&rdquo;.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">إذن الهدف من تأليف الكتاب هو استجابة لردة فعل قائم أرّقَتْ المسلمين ولعبت دورا كبيرا في تمزيق وحدتهم. لكن كيف سعى الكاتب لإقناع عامة المسلمين برأيه هذا، تم ذلك بوسيلتين:</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&ndash; أولاهما في الإضاءة الأولى: حيث نقل فيها تسعة عشر (19) شهادة من أعلام القرن الخامس الهجري فما بعد على أن مصطلح أهل السنة كانت تطلق على الأشاعرة (23-52)، كما نقل فتاوى وفوائد في ذلك من المتقدمين، وأخرى من المتأخرين، وأعقب بموضوع &ldquo;الطاعنون في الأشاعرة&rdquo; (53-74).</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">&ndash; ثانيهما بإعادة عرض العقيدة الإسلامية كما هي عند الأشاعرة منهجا وأسلوبا ومضمونا ورؤى،&nbsp;<strong>متخللا كل ذلك بالرد</strong>&nbsp;على موقف شيخ الإسلام خاصة. أجل، ركّز في الرد على شيخ الإسلام لإيمانه بأنه الداعي الأول إلى هذه الأفكار وهو الإمام والمصدر عند كل من اقتنع برأيه، ولذا يكثر المؤلف من إطلاق مدرسة &ldquo;التيمّيين&rdquo;.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">ويبدو أن الكاتب تتبع بعض ما يدل على أن الأشاعرة هم أهل السنة والجماعة، وأيّد ذلك بمناقشته للفكر الآخر. لكن ما يهمني هل بيانه هذا سيلعب دورا في وحدة المسلمين أو سيزيد فرقتهم؟</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\"><strong>رؤية تحليلية للكتاب</strong></p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">تصعب القراءة الموضوعية للكتاب، وذلك لأن أغلب القرّاء لديهم مواقف مسبقة نتيجة ما ذكرنا من آثار المنهجية القائمة. فإما أن يكون القارئ سلفيا؛ تربى في بيئة تنتسب إلى الحديث والأثر وتلقّى علومه من مشايخ المدرسة، وإما أن يكون&nbsp; أشعريا شاء القدر أن يدرس في الجامعات التي تتبنى الرؤى الأشعرية في تدريسها وتُؤصّل على ذلك. فأحدهما سيعشق الكتاب ويقدس فكرة الكاتب، والآخر سيُشَيْطِنُ الكتابَ ويحذر منه، اللهم إلا من باب الرد والنقد وبيان ما فيه من زيغ وشطط. الشأن في هذا مثل كتاب محمد سعيد رمضان البوطي: السلفية مرحلة زمنية مباركة لا مذهب إسلامي. ومع ذلك لو استطعتُ أن أكون موضوعيا ومنصفا لا مائلا لهذا ولا ذاك فإني ألفت النظر إلى الآتي:</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\"><strong>&ndash;</strong>&nbsp;التصنيف والتهميش باسم البحث عن &ldquo;الدليل الأقوى&rdquo; لا يحل المشكلة لأن الإشكالية في الدليل نفسه وفهمه. ولعل المؤلف كان شديد اللهجة على المخالف &ldquo;التيميين&rdquo; ولم يحاول احتضانهم بحال!</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\"><strong>&ndash;</strong>&nbsp;توسيع النظرة، وذلك أن أصول الدين يتمثل في خطاب جعفر أمام النجاشي، وأبي سفيان أمام هرقل، وفي نصوص عرض النبي صلى الله عليه وسلم نفسه على القبائل. والأمور المتعلقة بفهم هذه الأصول نتيجة التطور الزمني أو نشوء حوادث جديدة يجب أن تُقدّم باسم الفكر والخطاب الإسلامي، ويكون محل حوار، فيكون الأشعري والسلفي بمنزلة الشافعي والحنفي، لا بمنزلة المسلم أو الكافر أو السنة والبدعة.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\"><strong>&ndash;</strong>&nbsp;وبه يمكن تجازو هذه القضية التاريخية والالتفات إلى قضايا زمننا، ولعل هذا ما يحوم حوله دعاة تجديد علم الكلام، فلا يقصد عامتهم المضمون لكن خطاب العرض والمنهجية.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\"><strong>&ndash;</strong>&nbsp;حاول بعض الباحثين التأليف في أصول الدين بحيث تصل الفكرة دون الوقوع في براثن هذه الإشكالية التاريخية في تأليف العقيدة، وبدون معرفة أن ثمة أشعري وماتريدي وسلفي، بل وبدون التطرق إلى القضايا الخلافية القليلة مقارنة بالأكثر المتفق عليه، من ذلك كتاب &ldquo;الإسلام عقيدة وشريعة وأخلاق&rdquo;، وكتاب &ldquo;عقيدة المسلم&rdquo;، و&rdquo;المحكم في العقيدة&rdquo;، وكتاب &ldquo;ركائز الإيمان&rdquo;، و&rdquo;العقائد الإسلامية&rdquo;، و&rdquo;العقيدة الإسلامية وأسسها&rdquo;، وغيرها. وكان هدف هذه الكتب وضع منهاج جامعي أكاديمي للعقيدة وتبسيط مسائلها، وإن كانت فيها بعض الإشارات إلى الخلافات المذهبية إلا أنها لا تفرق الأمة إلى جبهتين أو قطبين متصارعين ومتقابلين.</p>\r\n\r\n<p dir=\"rtl\" style=\"text-align:justify\">أوصي المتخصص والمهتم بقراءة الكتاب بعين مجردة بدون سابق حكم، فالكتاب لا يخلو من فوائد، وإن أتى لطْماً قوياً لمدرسة فكرية ما! يفضل الابتعاد عن مثل هذا الأسلوب قدر المستطاع! كما أوصي أن يكون همّ العلماء ما يجمع الشمل ويوحّد الصف، لا الاصطياد في الماء العكر باسم الدليل وغيرها من المغالطات وما يصادر المطلوب من لوازم القول وترك الصريح!</p>', '2020-02-05 00:00:00', 'سيكو توري', 'yJpdiI6ImVOZWhyMWp1TWZhb3JmYWR4bG5pb3c9PSIsInZhbHV.jpg', NULL, 'kQzNFpaWVwvUlZZQVpuV', 1, 4, 1, 1, '2020-02-05 12:39:13', '2020-02-05 12:39:25');

-- --------------------------------------------------------

--
-- Structure de la table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `nom` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `categories`
--

INSERT INTO `categories` (`id`, `nom`, `slug`, `valide`, `publish`, `created_at`, `updated_at`) VALUES
(4, 'مقارنة الأديان', 'eyJpdiI6IjhnTjBoYmt5', 1, 1, '2019-11-22 17:24:45', '2019-11-22 17:24:45'),
(5, 'دراسة العقائد', 'eyJpdiI6IlF0TG9JYTM3', 1, 1, '2019-11-22 17:24:55', '2019-11-22 17:24:55'),
(6, 'دراسة شرائع الأديان', 'eyJpdiI6InB0R1wvWHlz', 0, 0, '2019-11-22 17:25:09', '2020-01-21 16:08:45'),
(7, 'الدراسات الصوفية', 'eyJpdiI6InpUUnJlbUh4', 1, 1, '2019-11-22 17:25:18', '2019-11-22 17:25:18'),
(8, 'التطرف والارهاب', 'eyJpdiI6ImFhNU5HdGRI', 1, 1, '2019-11-22 17:25:29', '2019-11-22 17:25:29'),
(9, 'علم الاجتماع الديني', 'eyJpdiI6ImNPZE0wVXYy', 1, 1, '2019-11-22 17:25:40', '2019-11-22 18:08:04'),
(10, 'علم النفس الديني', 'eyJpdiI6Im5qRXRNZmZi', 1, 1, '2019-11-22 18:08:18', '2019-11-22 18:08:18'),
(11, 'الإعلام الديني', 'eyJpdiI6Ik1cLzBnR1dN', 1, 1, '2019-11-22 18:08:30', '2019-11-22 18:08:30'),
(12, 'الدين والقانون', 'eyJpdiI6ImRyanNsakhS', 1, 1, '2019-11-22 18:08:41', '2019-11-22 18:08:41'),
(13, 'التحقيق', 'eyJpdiI6IlBwdHVpSUdU', 1, 1, '2019-11-22 18:08:53', '2019-11-22 18:08:53'),
(17, 'حوارات', 'mJ1RmRJNWFOUjVKcUorV', 1, 1, '2019-11-22 20:35:26', '2019-11-22 20:35:26'),
(18, 'حلق علمية', 'k1oTEJwdVpxSUFGZ1wvN', 1, 1, '2019-11-22 20:36:08', '2019-11-22 20:36:08'),
(20, 'الترجمة', 'nljMWQ2UnpSQms3Q05OS', 1, 1, '2020-01-21 16:08:36', '2020-01-21 16:09:08'),
(21, 'فلسفة الدين', 'kVvanZRcmsycHYxSGZIO', 1, 1, '2020-01-21 16:10:09', '2020-01-21 16:10:34'),
(22, 'مفاهيم', 'nd1NG9tWEhaWCtZREhjZ', 1, 1, '2020-02-05 11:18:32', '2020-02-05 11:18:54'),
(23, 'أعلام', 'nJGV3RISHVlYXUzVkxyO', 1, 1, '2020-02-05 11:49:29', '2020-02-05 11:49:54');

-- --------------------------------------------------------

--
-- Structure de la table `categorie_droit_acces`
--

CREATE TABLE `categorie_droit_acces` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `categorie_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `categorie_droit_acces`
--

INSERT INTO `categorie_droit_acces` (`user_id`, `categorie_id`, `created_at`, `updated_at`) VALUES
(2, 17, '2020-01-21 10:59:31', '2020-01-21 10:59:31');

-- --------------------------------------------------------

--
-- Structure de la table `categorie_evenements`
--

CREATE TABLE `categorie_evenements` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `nom` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `categorie_evenements`
--

INSERT INTO `categorie_evenements` (`id`, `nom`, `slug`, `valide`, `publish`, `created_at`, `updated_at`) VALUES
(3, 'ملتقيات ومؤتمرات', 'eyJpdiI6Ink0UGwwcDl6', 1, 1, '2019-11-22 18:10:28', '2019-11-25 22:24:21'),
(4, 'مناقشة أطاريح جامعية', 'eyJpdiI6IlB2RmdweE5z', 1, 1, '2019-11-22 18:10:42', '2019-11-25 22:24:15'),
(5, 'دورات تدريبية', 'eyJpdiI6Ikp4cDFueGZh', 1, 1, '2019-11-22 18:10:52', '2019-11-25 22:24:10'),
(7, 'مؤسسات و مراكز بحثية', 'jRGSkh0bG1NZlR4bE9ZS', 1, 1, '2020-01-21 16:14:24', '2020-01-21 16:15:06');

-- --------------------------------------------------------

--
-- Structure de la table `categorie_evenement_droit_acces`
--

CREATE TABLE `categorie_evenement_droit_acces` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `categorie_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `categorie_evenement_droit_acces`
--

INSERT INTO `categorie_evenement_droit_acces` (`user_id`, `categorie_id`, `created_at`, `updated_at`) VALUES
(2, 3, '2020-01-21 10:59:40', '2020-01-21 10:59:40');

-- --------------------------------------------------------

--
-- Structure de la table `commentaires`
--

CREATE TABLE `commentaires` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `contenu` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `article_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `commentaires`
--

INSERT INTO `commentaires` (`id`, `nom`, `email`, `contenu`, `valide`, `publish`, `article_id`, `created_at`, `updated_at`) VALUES
(1, 'testbbbbb', 'samia@gmail.com', 'the thisng is that i dont like u', 0, 0, 10, '2019-11-27 20:29:07', '2019-11-27 20:29:07'),
(2, 'test', 'test@test.ma', 'qsqssqsqsqs', 0, 0, 10, '2019-11-27 20:29:43', '2019-11-27 20:29:43'),
(3, 'test 12', 'test@test.ma', '12321654', 0, 0, 10, '2019-11-27 20:30:09', '2019-11-27 20:30:09'),
(4, 'testbbbbb', 'saidhaiba@gmail.com', 'kjlkjlkj', 0, 0, 10, '2019-11-28 22:24:42', '2019-11-28 22:24:42');

-- --------------------------------------------------------

--
-- Structure de la table `editions`
--

CREATE TABLE `editions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `titre` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `auteur` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date_publication` datetime DEFAULT NULL,
  `image` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `editions`
--

INSERT INTO `editions` (`id`, `titre`, `description`, `auteur`, `date_publication`, `image`, `slug`, `valide`, `publish`, `user_id`, `created_at`, `updated_at`) VALUES
(2, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p>وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض</p>', 'وريم ايبسوم', '2019-11-23 00:00:00', 'yJpdiI6ImxKeStiSktGbXl4STl0MmxJR0NIbWc9PSIsInZhbHV.jpg', 'llVemJ3emRRdW5DejFsQ', 1, 1, 1, '2019-11-23 14:57:04', '2019-11-24 16:20:33'),
(3, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p>وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض&nbsp;</p>', 'وريم ايبسوم', '2019-11-23 00:00:00', 'yJpdiI6ImhvcHNXNEZ2WWl3NzVqbkhnR1RDd2c9PSIsInZhbHV.jpg', 'jdlNmNjQUcza2FBZDIzM', 1, 1, 1, '2019-11-23 15:13:14', '2020-01-21 15:45:21');

-- --------------------------------------------------------

--
-- Structure de la table `evenements`
--

CREATE TABLE `evenements` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `titre` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `contenu` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` datetime DEFAULT NULL,
  `image` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `intervenant` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lieu` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `adresse` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `site` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `categorie_id` bigint(20) UNSIGNED NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `evenements`
--

INSERT INTO `evenements` (`id`, `titre`, `contenu`, `date`, `image`, `slug`, `intervenant`, `lieu`, `adresse`, `site`, `user_id`, `categorie_id`, `valide`, `publish`, `created_at`, `updated_at`) VALUES
(3, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p dir=\"rtl\">وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض</p>', '2019-11-22 12:00:00', 'yJpdiI6ImtHSHdCM3NwZnZhZENEWEVFaVQ3d2c9PSIsInZhbHV.jpg', 'eyJpdiI6IiswM0sxZ3g4anh3e', 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', NULL, NULL, 1, 3, 1, 1, '2019-11-22 18:58:13', '2019-11-24 17:09:43'),
(4, 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض', '<p>وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرضوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض</p>', '2019-11-23 10:00:00', 'yJpdiI6IkJhbDYzblFaUFgrVU5yaEtJTFVWekE9PSIsInZhbHV.jpg', 'mpDZlloQVI0QjZUNWUrV', 'التصاميم لتعرض', 'وريم ايبسوم ه', NULL, NULL, 1, 3, 1, 1, '2019-11-22 23:18:58', '2020-01-21 13:58:51'),
(5, 'يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف', '<h3 dir=\"rtl\">يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;يوم دراسيّ بعنوان قيم الاعتدال والتسامح في مواجهة التطرّف&nbsp;</h3>', '2019-11-23 12:00:00', 'yJpdiI6ImVTbzZhR24wcmErOGY0RGxcLzRzXC90dz09IiwidmF.jpg', 'jJIbjROU1dRZ2VscEFDd', 'يوم دراسيّ', 'الرباط', NULL, NULL, 1, 3, 0, 0, '2019-11-22 23:33:25', '2019-11-25 22:05:30'),
(6, 'الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف', '<h3 dir=\"rtl\">&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;&nbsp;الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف&nbsp;</h3>', '2019-11-15 10:00:00', 'yJpdiI6IlwveGlGUDYwcTRkSVkyVUFmUFdxdUlBPT0iLCJ2YWx.jpg', 'mdSU2pZSExWZ2dmYXFNU', 'الدكتور سعيد شبار يشارك في مائدة مستديرة حول: العلوم الإنسانية وقضايا الإرهاب والتطرف', 'الرباط', NULL, NULL, 1, 3, 0, 0, '2019-11-22 23:34:58', '2019-11-23 15:20:15'),
(7, 'أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر', '<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a>&nbsp;</h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3><a href=\"http://www.lomaa-test.ma/events-detail.html\">أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر</a></h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n<h3>&nbsp;</h3>', '2019-11-23 08:00:00', 'yJpdiI6IncrRFdtZHhTZUpiVE1BY1FQVWNoRUE9PSIsInZhbHV.jpg', 'nBBR2xkeGZFcnB6emxSY', 'أساتذة بالرباط يناقشون المذهب الأشعري وقضايا العصر', 'الرباط', NULL, NULL, 1, 3, 0, 0, '2019-11-22 23:36:39', '2019-11-22 23:36:39');

-- --------------------------------------------------------

--
-- Structure de la table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `images`
--

CREATE TABLE `images` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `image` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `images`
--

INSERT INTO `images` (`id`, `nom`, `valide`, `publish`, `image`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'حلق علمية', 1, 1, 'yJpdiI6InNKZDJxUDVMRXlLcXF3dWVLMmN4ZWc9PSIsInZhbHV.jpg', 1, '2019-11-23 19:34:18', '2019-11-26 22:04:30'),
(2, 'الدراسات الصوفية', 1, 1, 'yJpdiI6ImNcL3JITCtqbXJ5TlhiNnJndFord3BBPT0iLCJ2YWx.jpg', 1, '2019-11-23 19:34:32', '2019-11-26 22:05:03'),
(4, 'علم الاجتماع الديني', 1, 0, 'yJpdiI6IjNhZVVwQzRmR2ljNU9VUWkyXC9MQUJnPT0iLCJ2YWx.jpg', 2, '2019-11-25 02:05:42', '2020-02-05 12:14:02'),
(5, 'Islam infographic. Muslim culture', 1, 1, 'yJpdiI6IkQ1XC9IRW1FcjV2TEJjMkhNVlwvMnRJdz09IiwidmF.jpg', 1, '2020-02-05 12:13:47', '2020-02-05 12:14:08');

-- --------------------------------------------------------

--
-- Structure de la table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_10_16_183828_create_categories_table', 1),
(5, '2019_10_16_211025_create_articles_table', 1),
(6, '2019_11_16_225952_create_commentaires_table', 1),
(7, '2019_11_19_223826_create_categorie_droit_acces_table', 1),
(8, '2019_11_20_183805_create_user_article_notification', 1),
(9, '2019_11_21_180227_create_categorie_evenements_table', 1),
(10, '2019_11_21_181348_create_evenements_table', 1),
(11, '2019_11_21_190747_create_user_evenement_notification', 1),
(12, '2019_11_21_191335_create_categorie_evenement_droit_acces_table', 1),
(13, '2019_11_21_212723_create_sliders_table', 1),
(14, '2019_11_23_154438_create_editions_table', 1),
(15, '2019_11_23_181735_create_videos_table', 1),
(16, '2019_11_23_201730_create_images_table', 1);

-- --------------------------------------------------------

--
-- Structure de la table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `sliders`
--

CREATE TABLE `sliders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ordre` int(11) NOT NULL,
  `sliderable_id` bigint(20) UNSIGNED NOT NULL,
  `sliderable_type` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `sliders`
--

INSERT INTO `sliders` (`id`, `ordre`, `sliderable_id`, `sliderable_type`, `created_at`, `updated_at`) VALUES
(16, 3, 4, 'App\\Evenement', '2020-01-21 13:59:37', '2020-01-21 13:59:37'),
(17, 1, 19, 'App\\Article', '2020-02-05 12:31:58', '2020-02-05 12:31:58'),
(18, 2, 3, 'App\\Evenement', '2020-02-05 16:32:03', '2020-02-05 16:32:03');

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `role` int(11) NOT NULL,
  `statut` int(11) NOT NULL,
  `edition` tinyint(1) NOT NULL,
  `image` tinyint(1) NOT NULL,
  `video` tinyint(1) NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `role`, `statut`, `edition`, `image`, `video`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Khalid Mayar', 'khalidmayar@lomaa.ma', NULL, '$2y$10$FssDipfR1U7uenQivhSwn.IiV9lxSvM50tUopy7l2ah.e/efla3k6', 1, 1, 0, 0, 0, NULL, NULL, '2020-01-21 13:36:04'),
(2, 'user user', 'user@user.com', NULL, '$2y$10$1nGINFJ9DjaMEIJ16JASxudGrtcPw0qBDSjRCvwE1sOpjJSSpgthe', 2, 1, 0, 1, 0, NULL, NULL, '2020-01-21 15:49:00'),
(3, 'Mohammed Lakrita', 'med.lakrita@gmail.com', NULL, '$2y$10$.ihakl9IxSiKc24kfiLXZelPAFmbokSvsvD5C0l1Pi2sLvx.obc/.', 2, 1, 1, 0, 1, NULL, '2020-01-21 16:23:41', '2020-02-05 12:56:05');

-- --------------------------------------------------------

--
-- Structure de la table `user_article_notification`
--

CREATE TABLE `user_article_notification` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `article_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `user_evenement_notification`
--

CREATE TABLE `user_evenement_notification` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `evenement_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `videos`
--

CREATE TABLE `videos` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `titre` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `code_youtube` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valide` tinyint(1) NOT NULL DEFAULT '0',
  `publish` tinyint(1) NOT NULL DEFAULT '0',
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `videos`
--

INSERT INTO `videos` (`id`, `titre`, `description`, `code_youtube`, `image`, `slug`, `valide`, `publish`, `user_id`, `created_at`, `updated_at`) VALUES
(2, 'من هم العلويون؟', 'العلويون طائفة دينية تأسست منذ مئات السنين، لكن الغموض يخيم على معتقداتها. ماذا تعرفون عنها؟', '7l-MoI8cqHU', 'yJpdiI6Im1DZ1RZdjFCRmx2V1U2QnNkOG40clE9PSIsInZhbHV.jpg', 'nJBRG1QWEhDN05QYnhRQ', 1, 1, 1, '2019-11-23 18:10:05', '2020-01-21 12:57:13');

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `articles_user_id_foreign` (`user_id`),
  ADD KEY `articles_categorie_id_foreign` (`categorie_id`);

--
-- Index pour la table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `categorie_droit_acces`
--
ALTER TABLE `categorie_droit_acces`
  ADD PRIMARY KEY (`user_id`,`categorie_id`),
  ADD KEY `categorie_droit_acces_categorie_id_foreign` (`categorie_id`);

--
-- Index pour la table `categorie_evenements`
--
ALTER TABLE `categorie_evenements`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `categorie_evenement_droit_acces`
--
ALTER TABLE `categorie_evenement_droit_acces`
  ADD PRIMARY KEY (`user_id`,`categorie_id`),
  ADD KEY `categorie_evenement_droit_acces_categorie_id_foreign` (`categorie_id`);

--
-- Index pour la table `commentaires`
--
ALTER TABLE `commentaires`
  ADD PRIMARY KEY (`id`),
  ADD KEY `commentaires_article_id_foreign` (`article_id`);

--
-- Index pour la table `editions`
--
ALTER TABLE `editions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `editions_user_id_foreign` (`user_id`);

--
-- Index pour la table `evenements`
--
ALTER TABLE `evenements`
  ADD PRIMARY KEY (`id`),
  ADD KEY `evenements_user_id_foreign` (`user_id`),
  ADD KEY `evenements_categorie_evenement_id_foreign` (`categorie_id`);

--
-- Index pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `images`
--
ALTER TABLE `images`
  ADD PRIMARY KEY (`id`),
  ADD KEY `images_user_id_foreign` (`user_id`);

--
-- Index pour la table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Index pour la table `sliders`
--
ALTER TABLE `sliders`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Index pour la table `user_article_notification`
--
ALTER TABLE `user_article_notification`
  ADD PRIMARY KEY (`user_id`,`article_id`),
  ADD KEY `user_article_notification_article_id_foreign` (`article_id`);

--
-- Index pour la table `user_evenement_notification`
--
ALTER TABLE `user_evenement_notification`
  ADD PRIMARY KEY (`user_id`,`evenement_id`),
  ADD KEY `user_evenement_notification_evenement_id_foreign` (`evenement_id`);

--
-- Index pour la table `videos`
--
ALTER TABLE `videos`
  ADD PRIMARY KEY (`id`),
  ADD KEY `videos_user_id_foreign` (`user_id`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `articles`
--
ALTER TABLE `articles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT pour la table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT pour la table `categorie_evenements`
--
ALTER TABLE `categorie_evenements`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT pour la table `commentaires`
--
ALTER TABLE `commentaires`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT pour la table `editions`
--
ALTER TABLE `editions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `evenements`
--
ALTER TABLE `evenements`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `images`
--
ALTER TABLE `images`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT pour la table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT pour la table `sliders`
--
ALTER TABLE `sliders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT pour la table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `videos`
--
ALTER TABLE `videos`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Contraintes pour les tables déchargées
--

--
-- Contraintes pour la table `articles`
--
ALTER TABLE `articles`
  ADD CONSTRAINT `articles_categorie_id_foreign` FOREIGN KEY (`categorie_id`) REFERENCES `categories` (`id`),
  ADD CONSTRAINT `articles_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Contraintes pour la table `categorie_droit_acces`
--
ALTER TABLE `categorie_droit_acces`
  ADD CONSTRAINT `categorie_droit_acces_categorie_id_foreign` FOREIGN KEY (`categorie_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `categorie_droit_acces_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `categorie_evenement_droit_acces`
--
ALTER TABLE `categorie_evenement_droit_acces`
  ADD CONSTRAINT `categorie_evenement_droit_acces_categorie_id_foreign` FOREIGN KEY (`categorie_id`) REFERENCES `categorie_evenements` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `categorie_evenement_droit_acces_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `commentaires`
--
ALTER TABLE `commentaires`
  ADD CONSTRAINT `commentaires_article_id_foreign` FOREIGN KEY (`article_id`) REFERENCES `articles` (`id`);

--
-- Contraintes pour la table `editions`
--
ALTER TABLE `editions`
  ADD CONSTRAINT `editions_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Contraintes pour la table `evenements`
--
ALTER TABLE `evenements`
  ADD CONSTRAINT `evenements_categorie_evenement_id_foreign` FOREIGN KEY (`categorie_id`) REFERENCES `categorie_evenements` (`id`),
  ADD CONSTRAINT `evenements_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Contraintes pour la table `images`
--
ALTER TABLE `images`
  ADD CONSTRAINT `images_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Contraintes pour la table `user_article_notification`
--
ALTER TABLE `user_article_notification`
  ADD CONSTRAINT `user_article_notification_article_id_foreign` FOREIGN KEY (`article_id`) REFERENCES `articles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_article_notification_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `user_evenement_notification`
--
ALTER TABLE `user_evenement_notification`
  ADD CONSTRAINT `user_evenement_notification_evenement_id_foreign` FOREIGN KEY (`evenement_id`) REFERENCES `evenements` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_evenement_notification_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Contraintes pour la table `videos`
--
ALTER TABLE `videos`
  ADD CONSTRAINT `videos_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);